Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.TextManipulatorBase
The Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.TextManipulatorBase class defines a base class for all text manipulators.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.TextManipulatorBase.#ctor(Tekla.Structures.Plugins.DirectManipulation.Core.ManipulationContext)
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.TextManipulatorBase class.
manipulationContext: The manipulation context.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.TextManipulatorBase.Placement
Gets or sets the placement of the manipulator.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.TextManipulatorBase.Visible
Gets or sets the visibility of the manipulator.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.TextManipulatorBase.InternalManipulator
Gets or sets the internal manipulator.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.TextManipulatorBase.Request
Gets or sets the request object.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.TextManipulatorBase.AttachToManipulatorService(Tekla.BIM.DirectManipulation.Services.Manipulators.IManipulatorService)


Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.TextManipulatorBase.Dispose(System.Boolean)


Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.TextManipulatorBase.AttachHandlers
Attaches the event handlers to the correct events of the internal manipulator.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.TextManipulatorBase.DetachHandlers
Detaches the event handlers.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.TextManipulatorBase.RefreshRequestValue
Sets the current request for the internal manipulator.